{
    "tips":[
        "Press '?' to view keyboard shortcuts. It works almost everywhere.",
        "Press 'm' to return to messages.",
        "Press 'n' to goto the next commander without orders ('j' for previous commander without orders).",
        "Use 'PgUp' & 'PgDn' or scroll wheel to zoom map.",
        "Use arrow keys or middle mouse button to scroll map.",
        "Use 'a', 'ctrl' & 'shift' to select and deselect multiple commanders.",
        "Use 'PgUp', 'PgDn' & arrow keys to change the battle view.",
        "Press 'space' to pause the battle replay and 'q' to quit the replay.",
        "Pause battle and right click on units to view their stats.",
        "Use arrow keys to easily increase/decrease money spent on mercenaries or defence.",
        "Press 'Esc' to close windows.",
        "A printed Dominions 5 manual makes the game extra enjoyable. See www.illwinter.com for details on how to get one.",
        "Illwinter Game Design has another fantasy strategy series called Conquest of Elysium. It is a faster game with focus on lots of randomness and replayability.",
        "Press alt-return to switch between window and fullscreen mode",
        "Press alt-tab to leave Dominions 5 temporarily.",
        "Use screens of militia and cheap troops to draw enemy fire.",
        "You only get income from a province if it is possible to trace a path from it to a fort through friendly provinces only.",
        "You only get gems from sites if it is possible to trace a path from the site to a province with a lab.",
        "The Eunuch will increase the local defence value of the province he is located in by one per month, up to a maximum value of 19.",
        "Good leaders (capable of leading 3+ squads without penalty) can position their troops in line formations.",
        "A leader having more squads than his leadership value allows will get morale penalty for all his squads",
        "Good leaders give morale bonuses to their squads, poor leaders give morale penalties instead.",
        "You cannot combine mindless units and regular units in the same squad.",
        "Squads mixing undead/demons and regular units will get a morale penalty.",
        "The Stargazer is a master of void summonings and is less likely to suffer from insanity.",
        "Any Astral mage can enter R'lyeh's Void Gate to summon monsters, but only Starspawns and a few other astral beings have a chance of retaining their sanity.",
        "Berserker attribute bonuses are cumulative.",
        "Unburied corpses are generated by battles, plunder, bad events and destructive dominions.",
        "The number of unburied corpses decreases every turn.",
        "Large squads are less likely to rout.",
        "Place units with heat or cold radiation apart from other troops.",
        "Give your mages magical gems so they can cast more powerful spells.",
        "The only way to get rid of a curse is through a Wish spell.",
        "Give bodyguards to your most valuable mages. During an assassination attempt, up to 5 bodyguards will fight alongside the mage against the assassin.",
        "Fortresses gather resources from neighboring provinces.",
        "Every five temples increase your maximum dominion strength by one (more required in a disciple game).",
        "Sacred troops fighting in the same battle as a Pretender God within its own Dominion are blessed automatically.",
        "Some items grant the owner the ability to go berserk if wounded.",
        "Others force the owner to go berserk at the start of a battle.",
        "Many magic items grant the wearer partial resistance to fire, cold, lightning or poison.",
        "All troops have +1 morale in friendly dominion and -1 in enemy dominions.",
        "Fatigue will make a unit easier to hit.",
        "In army setup: double-click to mark all units of a kind.",
        "Routed units flee into any of the neighboring friendly provinces.",
        "Ambidextrous soldiers do not suffer from as much attack skill reduction when fighting with more than one weapon.",
        "Wastelands, mountains, swamps and forests are more likely to contain magic sites.",
        "Retreating from assassination attempts will result in getting killed.",
        "Make a prophet of a stealthy commander in order to get a stealthy preacher.",
        "In army setup: shift-click to mark all units in between.",
        "Pillage provinces to get more unburied corpses to reanimate when playing Ermor.",
        "Reanimation of ghouls will decrease population. Reanimation of soulless will decrease unburied corpses.",
        "Soulless reanimated in battles and in provinces where there has recently been a battle are armed. Heavily armed warriors will return as well equipped soulless while lightly armed soldiers will return as lightly armed soulless.",
        "Patrol reduces unrest, but it also kills a small part of the population for each point of unrest reduced.",
        "Pillage is more effective if the plundering army is large, fast and frightening.",
        "Fast troops are better at patrolling.",
        "Strong and flying units are good at besieging and defending castles.",
        "Mindless beings have reduced efficiency when defending against a siege, but have no penalty when on the besieging side",
        "Mindless units dissolve instead of rout when they are left leaderless in battle.",
        "Magical beings must have magical leadership.",
        "Undead must be led by necromancers, blood mages or undead generals.",
        "Press tab in the Nation Overview to hide all commanders.",
        "Beware: Some nations have leaders that can sail across oceans with their armies.",
        "Every point of province defence will result in 1 or more units that defend the province if it's attacked.",
        "Province defence values of 15 or more can reveal enemy scouts.",
        "The Bow of Botulf causes feeblemindedness regardless of magic resistance.",
        "Weapons and spells with area effect automatically hit all units in the area.",
        "Large armies hiding in enemy territories are easier to find than small ones.",
        "Units with glamour cannot be detected when moving in friendly provinces.",
        "You can resume a castle construction later if you are interrupted, unless the province is captured.",
        "Press z in the army setup to hide all researchers.",
        "Short weapons do not cause as much attack skill reduction when used in two weapon combinations.",
        "In army setup: hover mouse over a squad and press 'd' to mark all diseased units in that squad.",
        "In army setup: hover mouse over a squad and press 'w' to mark all wounded units in that squad.",
        "In army setup: hover mouse over a squad and press 'e' to mark all experienced units (with at least two stars) in that squad.",
        "In army setup: hover mouse over a squad and press 'a' to mark all units in that squad. Enter will deselect all troops.",
        "In army setup: hover mouse over a squad and press 's' to mark all starving units in that squad.",
        "In army setup: hover mouse over a squad and press 'i' to invert the selection.",
        "In the squad placement screen, press 'c' to center the squad on its commander.",
        "Remember to visit www.illwinter.com now and again to see if there are any news regarding Dominions 5.",
        "Try to change the graphics settings in the preferences menu if the game is too slow or if you have a fast computer and want a more detailed display.",
        "Put cavalry on the side of the battlefield and order them to attack the rearmost enemies. During combat they will try to outflank the enemy and attack his rear troops and commanders.",
        "All Illithids have a mind blast attack that will cause paralysis and minor damage to the target.",
        "Don't attack an army of Illithids with one commander and an army of soulless. Mindless beings like the soulless are immune to mind attacks and all Illithids will blast your commander.",
        "Most nations have to pay 400 gold to build a new temple. But some like Pangaea and Marverni pay only half the normal cost and Gath pays double the normal cost.",
        "Regenerating units are less likely to get battle afflictions when damaged.",
        "Immortal units may heal battle afflictions when they die and reform.",
        "Most of Pangaea's units heal battle afflictions automatically.",
        "Beware of nations with assassins like Abysia and Pythium. Assassins can kill your commanders unless you guard them well.",
        "A magic site with Conjuration Bonus makes it possible to cast conjuration rituals in that province for a reduced cost.",
        "A magic site with Enchantment Bonus makes it possible to cast enchantment rituals in that province for a reduced cost. There are also sites that reduce the cost of the rituals from other schools of magic.",
        "It is possible to set a commander to cast the same ritual spell every month. This is done by using the 'M' (monthly ritual) order shortcut.",
        "Flying units have a bonus to patrolling.",
        "It is possible to set a commander to forge the same magic item every month. This is done by using the 'O' (monthly forging) order shortcut.",
        "Only one priest may blood sacrifice at a temple at a time.",
        "Beware: Vanheim has troops with the glamour ability. These troops cannot be seen by scouts or scrying spells.",
        "Dragons usually appear in a human form more suitable for magic. They have a special order that lets them change shape.",
        "A third level mage casting a second level spell will only get half the listed spell fatigue.",
        "A fourth level mage casting a second level spell will only get one third of the listed spell fatigue.",
        "A fourth level mage casting a second level spell will receive a bonus of one when it comes to penetrating an enemy's magic resistance.",
        "A sixth level mage casting a second level spell will receive a bonus of two when it comes to penetrating an enemy's magic resistance.",
        "Press 'w' during battle replay to hide/show the 3d background.",
        "Press 'g' during battle replay to hide/show the grid.",
        "Press 'c' during battle replay to color squares in national colors.",
        "Press 1-3 during battle replay to control the amount of text information displayed.",
        "Forests are more likely to contain nature sites.",
        "Spies and bards are able to covertly instill uprisings. The resulting unrest may cripple wealthy or resource-rich enemy provinces.",
        "The dominions of Ashen Empire and Dreamlands kill population at a very fast rate. Soon the provinces under one of these dominions will be empty of all normal people, regardless of the Death scale.",
        "Being horror marked is permanent. The mark can never be totally removed, but staying dead will lessen the effect of a horror mark.",
        "The priestesses of Arcoscephale and some others can heal afflictions. There are many ways to get rid of afflictions but such healers are the only easy one.",
        "Prophets cost no upkeep.",
        "Make sure your god is skilled in death magic when playing the Ashen Empire of Ermor, as all national priests and mages are Death summons.",
        "Press alt+backspace when writing messages in order to delete an entire word.",
        "Press ctrl+1 on a commander's scripted orders to store them. You can then assign these orders to another commander by holding the mouse over his orders and pressing 1.",
        "Use ctrl + 1-9 to store battle orders for commanders or squads. Recall them by pressing 1-9.",
        "When viewing battles press 'f' for fast forward and 'n' to skip a battle turn.",
        "The number of sacred troops you can recruit - per province, per turn - is limited to your maximum dominion strength.",
        "Shift click to add ten units at a time to the recruitment queue.",
        "At level 15 and higher, province defense can catch sneaking enemies.",
        "Higher precision and action points make units better patrollers.",
        "Trampling units do higher damage the more sizes higher they are than their target.",
        "The spell \"Body Ethereal\" can be cast on nearby troops.",
        "Not all undead are inanimate or mindless.",
        "Ethereal units can walk straight through trees and walls on the battlefield.",
        "Commanders with ranged weapons can be ordered to fire at the rearmost enemies.",
        "Units with zero encumbrance accumulate no fatigue in melee no matter how much armour they wear.",
        "Armies that rout when surrounded by enemy lands always die, even if all the troops are stealthy or can fly.",
        "Commanders with sailing cannot retreat by sea.",
        "\"Ritual of Rebirth\" will only reincarnate fallen heroes of your own nation.",
        "Trolls require gold for upkeep and much of it.",
        "Communion slaves may die of fatigue before their masters fall unconscious.",
        "Buy at least one point of province defense whenever possible. An undefended province may be conquered by a single scout.",
        "The damage of a lance is based on the action points of the unit that wields it.",
        "Double click or hold down Alt to select all units of the same type on the army setup screen.",
        "Shields are very useful when attacking archers.",
        "It is possible but unlikely to get back from Inferno or Kokytos.",
        "If a commander token is red it means that the commander is insane this turn and will not take any orders.",
        "You can't recruit units while under siege, but you can still summon them.",
        "Magic sites with negative effects operate whether or not you discover them.",
        "Pierce weapons reduce armor by 20%.",
        "You can reorganize your items in the magic item treasury by holding down shift and clicking on them.",
        "Give order to a commander by holding the mouse over him and pressing for instance 'shift'+'R' for research.",
        "Snow does not increase the fatigue cost for fire spells.",
        "Give order to a commander by holding the mouse over him and pressing for instance 'shift'+'S' for search.",
        "Give order to a commander by holding the mouse over him and pressing for instance 'shift'+'P' for preach.",
        "Blunt weapons cause 50% more damage on hits to the head (after armor).",
        "Slash weapons cause 25% more damage after armor and will sever a bodypart if the damage is at least half the opponent's maximum HP. Only hit in the legs, arms and heads can result in a severing.",
        "You can search for magic sites in allied provinces too. This also applies to site searching rituals.",
        "There are magic items, rituals and magic sites that increases the range of rituals.",
        "Shock damage has a chance of stunning the target.",
        "A priest can preach to increase the dominion in the province he is located. The maximum value the dominion can be raised to by preaching is twice the priest level and one extra if there is a temple in the province.",
        "To pass through a mountain pass (orange border) you must wait for the heat level to be at least one on both sides of the mountain. Troops with mountain survival or flying can cross regardless of temperature.",
        "To pass over a river border (blue border) you need to wait until the river is frozen or use units with flying, swimming or underwater breathing abilities.",
        "If you mix ordinary units with undisciplined units then the whole squad becomes undisciplined.",
        "Mercenaries that retreat are gone, but mercenary commanders that survive their contract will recruit new members.",
        "Hunting for blood slaves becomes harder when the population is below 5000.",
        "A local lab is required to assign gems and items from your stockpile to commanders.",
        "Acid damage has a chance of making the target's armor rust",
        "A lower site frequency game setting will also make hunting for blood slaves more difficult.",
        "Targeting a teleport spell at your fort under siege will land the units inside the fort, not breaking siege.",
        "Some nations have units that may only be recruited in certain terrains.",
        "In order to be passable for most units, rivers must be frozen by a cold scale on both sides.",
        "Deep seas never change in temperature and shallow seas can only change a little.",
        "Pressing 'l' while hovering over a magic item, sends the item directly to the lab.",
        "Press ctrl+home to select your pretender and alt+home to select your prophet.",
        "Rain increases the fatigue cost for most fire spells and reduces the effect of certain heat effects.",
        "Regeneration only works when you are below your maximum hit points. For pretenders in hostile dominion this means that regeneration may not start until the pretender is near dead.",
        "It costs 2 extra movement points to traverse a snow covered province.",
        "Swamp is the most difficult terrain to move through. It costs 14 movement points to move through an entire swamp province.",
        "A Pretender God having 3 in all elemental or sorcery paths will receive bless effects for those paths.",
        "Some bless effects are passive, meaning that it affects all sacred units even when they are not blessed. Terrain Survival and Larger are example of passive blesses.",
        "Provinces with high population have more recruitment points.",
        "Forts increase gold income, resources and recruitment points for the province it is built in.",
        "You are more likely to survive when retreating if you have mostly friendly provinces to retreat to.",
        "Quickness also results in aging twice as fast.",
        "The magic scale determines how much completed spell research a nation starts with.",
        "Commanders empowering themselves in blood magic risk getting tainted and noticed by horrors.",
        "Blood Contracts are remarkably easy to create for their power.",
        "Units with the unsurroundable ability get less penalty from being swarmed by multiple opponents.",
        "Pretender Gods and Disciples are always blessed in friendly dominion and never otherwise.",
        "A Pretender getting killed will usually lose one point of magic or one point of dominion strength. A high level of nature makes it more likely to lose some magic skill instead of losing dominion strength.",
        "A Pretender that has died is most likely to lose a point of nature magic and least likely to lose death.",
        "You must own the province or have a priest there to know who the owner of the enemy dominion is.",
        "In the early age you only know the name of neighboring provinces. In the late age the province names are known from 3 provinces away.",
        "The God's most powerful magic path determines what kind of Banishment and Smite spell the priests get.",
        "An immortal unit that is soul slayed will be permanently killed.",
        "Most immortal units can reform and live again regardless of where they are killed, as long as it is on the same plane.",
        "Dominion immortal units are permanently dead if they are killed outside of friendly dominion.",
        "Spell are prepared for about half the casting time before being cast, afterwards the mage has to recover for the remaining part of the casting time.",
        "While preparing a spell the mage can get interrupted if he takes damage.",
        "Combat casters and mindless units are less likely to get their spells interrupted when taking damage.",
        "Press F1 in combat to view a list of all units, including the dead ones. From here you can click on a unit and view their personal battle log.",
        "Press 'v' when inspecting a unit in combat to view his personal combat log.",
        "Units in battle constantly regain 1 point of fatigue per round.",
        "Units with size 4 or more gets one extra weapon length.",
        "Units with the Guard Commander order always deploy next to the commander they are guarding.",
        "Gladiators remain in service until they kill someone or get wounded.",
        "Bows only add one third of the wielder's strength to the damage.",
        "Two-handed weapons add 125% of the wielder's strength when calculating damage.",
        "When positioning a squad you can right click on other squads to select and position them as well.",
        "The size of the entire battlefield is usually about 80*40 squares.",
        "If you make a misstake when recruiting you can restore the recruitment queues to how they were at the start of the turn. Press '?' in the recruitment screen to find out how.",
        "A dead Pretender God can be recalled by his priests. It takes a total of about 50 priest level turns to recall a Pretender God, but the value is not exact. Gods that are or have disciples will require 50% more priest time to recall.",
        "In the army setup screen, sneaking commanders are shown on a grey background. These will usually not participate in an upcoming battle."
    ]
}
